# CheckPlanViewRangeValidity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewPlan..::..CheckPlanViewRangeValidity Method
ViewPlan Class See Also
---
Checks if the plan view range is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<PlanViewRangeError> CheckPlanViewRangeValidity(
	PlanViewRange planViewRange
)
```

Visual Basic
---
```text
Public Function CheckPlanViewRangeValidity ( _
	planViewRange As PlanViewRange _
) As IList(Of PlanViewRangeError)
```

Visual C++
---
```text
public:
IList<PlanViewRangeError>^ CheckPlanViewRangeValidity(
	PlanViewRange^ planViewRange
)
```

# ### Parameters
planViewRange
    Type: Autodesk.Revit.DB..::..PlanViewRange The view range to validate.
# ### Return Value
List of enums describing any errors in the plan view range.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewPlan Class
Autodesk.Revit.DB Namespace